<?php


namespace App\classes;


class Product
{
    public $products=[],$data=[];
    public function __construct()
    {
        $this->products=[
            0=>[
                'id'=> 1,
                'category_id'=>1,
                'title'=>'বেনজেমার রিয়ালে থাকা নিয়ে কোনো সন্দেহ নেই আনচেলত্তিদের',
                'description'=>'করিম বেনজেমা কি রিয়াল মাদ্রিদে থাকবেন, নাকি পাড়ি জমাবেন সৌদি আরবের ফুটবলে—ইউরোপের ফুটবল মহলে নতুন করেই প্রবেশ করেছে এই আলোচনা। লিওনেল মেসির সৌদি আরবের ফুটবলে খেলতে যাওয়া নিয়ে গুঞ্জন একপ্রকার পুরোনোই হয়ে গেছে। তবে সেটার নিষ্পত্তি হওয়ার আগেই নতুন করে বেনজেমাকে নিয়ে গুঞ্জন।

                           সৌদি আরবের ক্লাব আল ইত্তিহাদ বেনজেমাকে ৪০ কোটি ইউরোর প্রস্তাব দিয়েছে, এটা দিয়ে গুঞ্জনের শুরু। এরপর দ্রুতই খবর এল, বেনজেমা রিয়াল মাদ্রিদকে জানিয়ে দিয়েছেন—তিনি সৌদি আরবের ফুটবলে খেলতে যাবেন। বিষয়টি নিয়ে বেনজেমাকে প্রশ্ন করলে তিনি রহস্যটা রেখে দিয়ে বলেছেন, ‘আমি এখনো মাদ্রিদেই আছি। আপাতত বিলবাওয়ের বিপক্ষে ম্যাচ নিয়ে ভাবছি।',
                'image'=>'assets/img-2/2.jpg'

            ],
            1=>[
                'id'=> 2,
                'category_id'=>2,
                'title'=>'নিমতলীবাসীর মনের ক্ষত এখনো শুকায়নি ',
                'description'=>'পুরান ঢাকার নিমতলীর ৪৩ নবাব কাটারার পাঁচতলা ভবনের নিচতলায় আগুন লেগে তা মুহূর্তেই আশপাশের ভবনগুলোয় ছড়িয়ে পড়ে ১২৪ জন মানুষ প্রাণ হারান। ১৩ বছর আগের ভয়াবহ সেই আগুনে পুড়ে যাওয়া ভবনগুলোর ক্ষতচিহ্নগুলো এখন আর নেই, সেগুলো সংস্কার করা হয়েছে। তবে স্বজনহারা ও দগ্ধ মানুষের শরীরের ক্ষত শুকালেও তাঁদের মনের ক্ষত এখনো শুকায়নি। সেই স্মৃতি তাঁদের আজও দগদগে।

নিমতলীর বাসিন্দারা বলেন, চকবাজারের চুড়িহাট্টায় অগ্নিকাণ্ডের ঘটনায় মামলা ও ভবনমালিক গ্রেপ্তার হলেও নিমতলীর ভবনমালিকের গ্রেপ্তার তো দূরের কথা, জিজ্ঞাসাবাদের মুখোমুখি হতে হয়নি। এখনো তাঁদের একটাই দাবি, শতাধিক মানুষের মৃত্যুর এ ঘটনায় যেন মামলা করে দায়ী ব্যক্তিদের সুষ্ঠু বিচার করা হয়। নিমতলীর ঘটনায় মামলা ও বিচার হলে চুড়িহাট্টার ঘটনার পুনরাবৃত্তি হতো না বলে তাঁরা মনে করছেন।',
                'image'=>'assets/img-2/3.jpg'
            ],
            2=>[
                'id'=> 3,
                'category_id'=>3,
                'title'=>'১০টি সংসদীয় আসনের সীমানায় পরিবর্তন',
                'description'=>'দ্বাদশ জাতীয় সংসদ নির্বাচন সামনে রেখে ১০টি সংসদীয় আসনের সীমানায় পরিবর্তন এনেছে নির্বাচন কমিশন (ইসি)। এই ১০টি বাদে সংসদের ৩০০ আসনের বাকিগুলোতে সীমানায় কোনো পরিবর্তন আনা হয়নি।

যে ১০টি আসনের সীমানায় পরিবর্তন এসেছে সেগুলো হলো পিরোজপুর–১ , পিরোজপুর–২, কুমিল্লা-১, কুমিল্লা-২, ফরিদপুর–২, ফরিদপুর–৪, গাজীপুর–২ ও গাজীপুর–৫ এবং নোয়াখালী–১ ও নোয়াখালী– ২ আসন। এর মধ্যে চারটি আসনের সীমানায় এসেছে বড় পরিবর্তন।',
                'image'=>'assets/img-2/4.jpg'
            ],
//            3=>[
//                'id'=> 4,
//                'category_id'=>4,
//                'title'=>'',
//                'description'=>'',
//                'image'=>'assets/img-2/2.jpg'
//            ],
            4=>[
                'id'=> 5,
                'category_id'=>5,
                'title'=>'গুগলের তথ্যে ধরা পড়লেন বাংলাদেশি শিশু যৌন নিপীড়ক',
                'description'=>'নারায়ণগঞ্জ ও দিনাজপুরের ১০ বছরের কম বয়সী একাধিক শিশুকে যৌন নিপীড়ন করেছিলেন ২৬ বছর বয়সী ইনজামামুল ইসলাম। তিনি যৌন নিপীড়নের সেই দৃশ্যগুলো ভিডিও ধারণ করে রেখে দেন নিজের মুঠোফোনে। গুগলের কল্যাণে গ্রেপ্তার হয়েছেন তিনি।

 ইনজামামুল ইসলামের মুঠোফোনে এমন দৃশ্য থাকার তথ্য গুগল দিয়েছিল যুক্তরাষ্ট্রভিত্তিক প্রতিষ্ঠান ন্যাশনাল সেন্টার ফর মিসিং অ্যান্ড এক্সপ্লয়টেড চিলড্রেনের (এনসিএমইসি) কাছে। তারা সেই তথ্য বাংলাদেশের পুলিশ সদর দপ্তরকে জানায়।',
                'image'=>'assets/img-2/5.jpg'
            ],
            5=>[
                'id'=> 6,
                'category_id'=>6,
                'title'=>'অধ্যাপক ইউসুফ আবদুল্লাহ ‘কটলার ডিস্টিংগুইসড প্রফেসর অব মার্কেটিং’ উপাধিতে ভূষিত',
                'description'=>'অধ্যাপক আবু ইউসুফ মো. আবদুল্লাহ ‘কটলার ডিস্টিংগুইসড প্রফেসর অব মার্কেটিং’ উপাধিতে ভূষিত হয়েছেন। দেশ–বিদেশে মার্কেটিং শিক্ষায় অবদান রাখায় কটলার ইমপ্যাক্ট ইনকরপোরেটেড কানাডার পক্ষ থেকে তাঁকে এ সম্মাননা দেওয়া হয়। এক সংবাদ বিজ্ঞপ্তিতে এ তথ্য জানানো হয়েছে।

অধ্যাপক আবু ইউসুফ মো. আবদুল্লাহ ঢাকা বিশ্ববিদ্যালয়ের ব্যবসায় প্রশাসন ইনস্টিটিউটের শিক্ষক। তিনি ব্যবসায় প্রশাসন, মার্কেটিং শিক্ষা, শিল্প–বাণিজ্য ও অর্থনৈতিক জগতের অভিজ্ঞতাসম্পন্ন একজন স্বনামধন্য ব্যক্তি। তিনি আধুনিক মার্কেটিংয়ের জনক অধ্যাপক ফিলিপ কটলারের সঙ্গে চার বছর ধরে কটলার ইমপ্যাক্ট এবং ওয়ার্ল্ড মার্কেটিং সামিটের গ্লোবাল অ্যাডভাইজার হিসেবে কাজ করে যাচ্ছেন।',
                'image'=>'assets/img-2/6.jpg'
            ],
            6=>[
                'id'=> 7,
                'category_id'=>7,
                'title'=>'প্রেসিডেন্ট হিসেবে তৃতীয় মেয়াদে শপথ নিলেন এরদোয়ান',
                'description'=>'তৃতীয় মেয়াদে তুরস্কের প্রেসিডেন্ট হিসেবে শপথ নিলেন রিসেপ তাইয়েপ এরদোয়ান। আজ শনিবার পাঁচ বছরের জন্য তিনি নতুন প্রেসিডেন্ট হিসেবে শপথ নেন। এর মধ্য দিয়ে এরদোয়ানের শাসনক্ষমতা তিন দশকে গড়াল।

প্রেসিডেন্টের দায়িত্ব পালনের আগে কয়েক দফায় দেশটির প্রধানমন্ত্রী ছিলেন একে পার্টির এই নেতা।

আজ তুরস্কের রাজধানী আঙ্কারায় পার্লামেন্টে তাঁর শপথ গ্রহণ অনুষ্ঠানের আয়োজন করা হয়। দেশটির জাতীয় টেলিভিশন অনুষ্ঠানটি সরাসরি সম্প্রচার করে।',
                'image'=>'assets/img-2/7.jpg'
            ],
        ];
    }
    public function gettAllProduct()
    {
        return $this->products;
    }
    public function productDetailId($id)
    {
        foreach ($this->products as $product)
        {
            if($product['id']== $id)
            {
                return $product;
            }
        }
    }
    public function categoryByid($id)
    {
        foreach ($this->products as $product)
        {
            if($product['category_id']==$id)
            {
                array_push($this->data,$product);
            }
        }
        return $this->data;
    }
}